[
     {
          "title": "McKinsey’s Dealings With Despots Are More Extensive Than We Knew",
          "description": "The\npast few years have seen a range of published reports regarding the work that\nAmerica’s top consulting firms, led primarily by industry behemoth McKinsey,\nhave done on behalf of despotic clients abroad. In dribs and drabs, we’ve\nlearned that McKinsey has …",
          "url": "https://newrepublic.com/article/188970/mckinsey-consultant-foreign-despots-influence",
          "content": "But\r\nMcKinseys foreign work didnt stop there. As investigators discovered, the\r\nfirm has significantly expanded its relationship with Narendra Modis\r\ngovernment in India, even as Modi has degraded In… [+1909 chars]"
     },
     {
          "title": "Indian oil giant probes bribery accusations linked to US firm",
          "description": "Indian Oil Corporation is investigating allegations that US firm Albemarle bribed its officials to secure business contracts Read Full Article at RT.com",
          "url": "https://www.rt.com/india/609818-india-oil-launches-probe-us-firm/",
          "content": "Indian Oil Corporation (IOC) has launched an investigation into allegations that a US specialty chemicals firm bribed its officials 15 years ago to obtain contracts for supplying catalysts, PTI news … [+1977 chars]"
     },
     {
          "title": "Russia and India strike largest-ever energy deal – Reuters",
          "description": "Russia’s Rosneft will reportedly supply nearly 500,000 barrels of oil per day to Indian private refiner Reliance in record-breaking deal Read Full Article at RT.com",
          "url": "https://www.rt.com/india/609276-russia-india-oil-deal/",
          "content": "Russia’s state energy giant Rosneft has agreed to supply nearly 500,000 barrels per day of various crude grades to Indian private refiner Reliance, Reuters reported on Thursday, citing its sources. W… [+2380 chars]"
     },
     {
          "title": "‘God Mode’: Like an invincible gamer, Gautam Adani’s rise as a global industrialist parallels that of India",
          "description": "The Adani Group is an investor favorite, with interests in ports, airports, energy and defense, and has made good use of PM Modi’s diplomacy Read Full Article at RT.com",
          "url": "https://www.rt.com/india/609205-making-of-oligarch-gautam-adani-india/",
          "content": "The growth of Gautam Adani’s businesses is now of interest to almost every nation. The low-profile Indian industrialist climbed into the global list of the ultra-rich and despite hurdles is likely to… [+13151 chars]"
     },
     {
          "title": "The Great Game in the Arctic: Why the region is the next flashpoint between superpowers",
          "description": "As global powers compete for dominance over the Arctic, both China and India are aiming at a larger role in the strategic region Read Full Article at RT.com",
          "url": "https://www.rt.com/india/608765-great-game-in-arctic-russia-india/",
          "content": "By Air Marshal Anil Chopra (Retired) is a veteran fighter test pilot of the Indian Air Force, having served for 40 years. He is also former Director-General of the Center for Air Power Studies in New… [+12123 chars]"
     },
     {
          "title": "BPCL to set up new greenfield refinery project in Andhra Pradesh, India",
          "description": "The refinery is estimated to have at least a nine million tonnes (180,000 barrels per day) capacity.",
          "url": "https://www.offshore-technology.com/news/bpcl-greenfield-refinery-project/",
          "content": "Indian oil and gas firm Bharat Petroleum Corporation (BPCL) has chosen Andhra Pradesh as the location for a new oil refinery-cum-petrochemical complex, which may be India's final greenfield project a… [+2754 chars]"
     },
     {
          "title": "U.S. CISA adds Cleo Harmony, VLTrader, and LexiCom flaw to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Cleo Harmony, VLTrader, and LexiCom flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the vulnerability CVE-2024-50623 …",
          "url": "https://securityaffairs.com/171973/security/u-s-cisa-adds-cleo-harmony-vltrader-and-lexicom-flaw-to-its-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds Cleo Harmony, VLTrader, and LexiCom flaw to its Known Exploited Vulnerabilities catalog\r\n | German agency BSI sinkholed a botnet of 30,000 devices infected with BadBox\r\n | U.S. authori… [+123398 chars]"
     },
     {
          "title": "U.S. CISA adds Microsoft Windows Kernel-Mode Driver and Adobe ColdFusion flaws to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Microsoft Windows Kernel-Mode Driver and Adobe ColdFusion flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the Micros…",
          "url": "https://securityaffairs.com/172059/security/u-s-cisa-adds-microsoft-windows-kernel-mode-driver-and-adobe-coldfusion-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds Microsoft Windows Kernel-Mode Driver and Adobe ColdFusion flaws to its Known Exploited Vulnerabilities catalog\r\n | ConnectOnCall data breach impacted over 900,000 individuals\r\n | Repor… [+124062 chars]"
     },
     {
          "title": "Security Affairs newsletter Round 502 by Pierluigi Paganini – INTERNATIONAL EDITION",
          "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. IOCONTROL cybe…",
          "url": "https://securityaffairs.com/171995/uncategorized/security-affairs-newsletter-round-502-by-pierluigi-paganini-international-edition.html",
          "content": "Security Affairs newsletter Round 502 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | IOCONTROL cyberweapon used to target infrastructure in the US and Isreael\r\n | U.S. CISA adds Cleo Harmony, VLTrad… [+123562 chars]"
     },
     {
          "title": "Report claims that Serbian authorities abused Cellebrite tool to install NoviSpy spyware",
          "description": "Researchers warn of previously undetected surveillance spyware, named NoviSpy, that was found infecting a Serbian journalist’s phone. In February 2024, Serbian journalist Slaviša Milanov was summoned to a police station after a routine traffic stop. After the…",
          "url": "https://securityaffairs.com/172039/malware/novispy-spyware-serbian-journalist.html",
          "content": "Report claims that Serbian authorities abused Cellebrite tool to install NoviSpy spyware\r\n | Multiple flaws in Volkswagen Group's infotainment unit allow for vehicle compromise\r\n | PUMAKIT, a sophist… [+123868 chars]"
     },
     {
          "title": "Russia FSB relies on Ukrainian minors for criminal activities disguised as “quest games”",
          "description": "Ukraine’s SBU uncovered an FSB espionage campaign recruiting minors for criminal activities disguised as “quest games.” The Security Service of Ukraine (SBU or SSU) uncovered a new espionage campaign linked to Russia’s intelligence agency Federal Security Ser…",
          "url": "https://securityaffairs.com/172052/intelligence/fsb-relies-on-ukrainian-minors-for-criminal-activities-disguised-as-quest-games.html",
          "content": "Russia FSB relies on Ukrainian minors for criminal activities disguised as \"quest games\"\r\n | U.S. CISA adds Microsoft Windows Kernel-Mode Driver and Adobe ColdFusion flaws to its Known Exploited Vuln… [+124155 chars]"
     },
     {
          "title": "Raccoon Infostealer operator sentenced to 60 months in prison",
          "description": "Raccoon Infostealer operator Mark Sokolovsky was sentenced to 60 months in US prison and ordered to pay over $910,000 in restitution. The US Department of Justice sentenced the Ukrainian national Mark Sokolovsky (28) for his role in the distribution of the Ra…",
          "url": "https://securityaffairs.com/172163/cyber-crime/raccoon-infostealer-operator-sentenced-to-60-months-prison.html",
          "content": "Raccoon Infostealer operator sentenced to 60 months in prison\r\n | Mirai botnet targets SSR devices, Juniper Networks warns\r\n | Fortinet warns about Critical flaw in Wireless LAN Manager FortiWLM\r\n | … [+124923 chars]"
     },
     {
          "title": "Romanian national was sentenced to 20 years in prison for his role in NetWalker ransomware attacks",
          "description": "Romanian national was sentenced to 20 years in prison for his role in NetWalker ransomware attacks, pleading guilty to fraud charges in June. Romanian national Daniel Christian Hulea, 30, was sentenced to 20 years in prison for his role in NetWalker ransomwar…",
          "url": "https://securityaffairs.com/172182/cyber-crime/romanian-national-was-sentenced-to-20-years-netwalker-attacks.html",
          "content": "Romanian national was sentenced to 20 years in prison for his role in NetWalker ransomware attacks\r\n | Sophos fixed critical vulnerabilities in its Firewall product\r\n | U.S. CISA adds BeyondTrust sof… [+125184 chars]"
     },
     {
          "title": "DMM Bitcoin $308M Bitcoin heist linked to North Korea",
          "description": "Japanese and U.S. authorities attributed the theft of $308 million cryptocurrency from DMM Bitcoin to North Korean cyber actors. Japanese and U.S. authorities linked the $308 million cyber heist targeting cryptocurrency company DMM Bitcoin to North Korea-link…",
          "url": "https://securityaffairs.com/172290/hacking/dmm-bitcoin-308m-theft-linked-north-korea.html",
          "content": "DMM Bitcoin $308M Bitcoin heist linked to North Korea\r\n | Adobe is aware that ColdFusion bug CVE-2024-53961 has a known PoC exploit code\r\n | Apache Foundation fixed a severe Tomcat vulnerability\r\n | … [+126001 chars]"
     },
     {
          "title": "Experts warn of a surge in activity associated FICORA and Kaiten botnets",
          "description": "FortiGuard Labs observed increased activity from two botnets, the Mirai variant “FICORA” and the Kaiten variant “CAPSAICIN”. FortiGuard Labs researchers observed a surge in activity associated with two botnets, the Mirai variant “FICORA” and the Kaiten varian…",
          "url": "https://securityaffairs.com/172373/uncategorized/surge-ficora-kaiten-botnets.html",
          "content": "Experts warn of a surge in activity associated FICORA and Kaiten botnets\r\n | Brazilian citizen charged for threatening to release data stolen from a company in 2020\r\n | A new Mirai botnet variant tar… [+126514 chars]"
     },
     {
          "title": "China-linked actors hacked US Treasury Department",
          "description": "China-linked threat actors breached the U.S. Treasury Department by hacking a remote support platform used by the agency. China-linked threat actors breached the U.S. Treasury Department via a compromised remote support platform. The Treasury Department disco…",
          "url": "https://securityaffairs.com/172482/intelligence/china-hacked-u-s-treasury-department.html",
          "content": "An X user claimed a 7-Zip zero-day vulnerability, but 7-Zip's creator says is a fake\r\n | Cisco states that the second data leak is linked to the one from October\r\n | Threat actors attempt to exploit … [+127189 chars]"
     },
     {
          "title": "An X user claimed a 7-Zip zero-day vulnerability, but 7-Zip’s creator says is a fake",
          "description": "An X user using the handle @NSA_Employee39 disclosed a zero-day vulnerability in the open-source file archive software 7-Zip. A verified X account, @NSA_Employee39, claimed to disclose a zero-day vulnerability in the open-source file archive software 7-Zip. T…",
          "url": "https://securityaffairs.com/172467/hacking/an-x-user-claimed-a-7-zip-zero-day-vulnerability.html",
          "content": "An X user claimed a 7-Zip zero-day vulnerability, but 7-Zip's creator says is a fake\r\n | Cisco states that the second data leak is linked to the one from October\r\n | Threat actors attempt to exploit … [+127189 chars]"
     },
     {
          "title": "Hacking campaign compromised at least 16 Chrome browser extensions",
          "description": "Threat actors compromised at least 16 Chrome browser extensions leading to the exposure of data from over 600,000 users. A supply chain attack compromised 16 Chrome browser extensions, exposing over 600,000 users. Threat actors targeted the publishers of the …",
          "url": "https://securityaffairs.com/172491/hacking/chrome-browser-extensions-compromise.html",
          "content": "Hacking campaign compromised at least 16 Chrome browser extensions\r\n | An X user claimed a 7-Zip zero-day vulnerability, but 7-Zip's creator says is a fake\r\n | Cisco states that the second data leak … [+127260 chars]"
     },
     {
          "title": "Brazilian citizen charged for threatening to release data stolen from a company in 2020",
          "description": "A Brazilian citizen faces U.S. charges for allegedly threatening to release data stolen from a company in a March 2020 security breach. The U.S. government has charged the Brazilian citizen Junior Barros De Oliveira, 29, with allegedly threatening to release …",
          "url": "https://securityaffairs.com/172362/hacking/brazilian-citizen-extortion-attempt.html",
          "content": "Brazilian citizen charged for threatening to release data stolen from a company in 2020\r\n | A new Mirai botnet variant targets DigiEver DS-2105 Pro DVRs\r\n | A ransomware attack disrupted services at … [+126437 chars]"
     },
     {
          "title": "Security Affairs newsletter Round 504 by Pierluigi Paganini – INTERNATIONAL EDITION",
          "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Pro-Russia gro…",
          "url": "https://securityaffairs.com/172413/breaking-news/security-affairs-newsletter-round-504-by-pierluigi-paganini-international-edition.html",
          "content": "Security Affairs newsletter Round 504 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | Pro-Russia group NoName targeted the websites of Italian airports\r\n | North Korea actors use OtterCookie malware … [+126750 chars]"
     },
     {
          "title": "Proposed updates to HIPAA Security Rule mandate to restore the loss of certain relevant electronic information systems and data within 72 hours",
          "description": "HHS OCR proposed updates to the HIPAA Security Rule to boost cybersecurity for electronic protected health information (ePHI). On December 27, 2024, the United States Department of Health and Human Services’ (HHS) Office for Civil Rights (OCR) proposed update…",
          "url": "https://securityaffairs.com/172518/breaking-news/hhs-updates-hipaa-security-rule.html",
          "content": "Proposed updates to HIPAA Security Rule mandate to restore the loss of certain relevant electronic information systems and data within 72 hours\r\n | U.S. Treasury sanctions Russian and Iranian entitie… [+127585 chars]"
     },
     {
          "title": "U.S. Treasury sanctions Russian and Iranian entities for interfering in the presidential election",
          "description": "The U.S. Treasury sanctioned entities for disinformation tied to Russian and Iranian intelligence before the 2024 presidential elections. The U.S. Treasury sanctioned entities for spreading disinformation linked to Russian and Iranian intelligence ahead of th…",
          "url": "https://securityaffairs.com/172520/laws-and-regulations/u-s-treasury-sanctioned-russia-and-iran-entities-for-disinformation.html",
          "content": "U.S. Treasury sanctions Russian and Iranian entities for interfering in the presidential election\r\n | Rhode Island s data from health benefits system leaked on the dark web\r\n | Hacking campaign compr… [+127437 chars]"
     },
     {
          "title": "Russia’s FSB used spyware against a Russian programmer",
          "description": "Russia’s FSB used spyware against a Russian programmer after detaining him for allegedly donating to Ukraine earlier this year. The Federal Security Service (FSB) used spyware to monitor a Russian programmer, Kirill Parubets, after he was detained earlier thi…",
          "url": "https://securityaffairs.com/171767/malware/russias-fsb-used-spyware-against-a-russian-programmer.html",
          "content": "Romania s election systems hit by 85,000 attacks ahead of presidential vote\r\n | New Atrium Health data breach impacts 585,000 individuals\r\n | U.S. CISA adds CyberPanel flaw to its Known Exploited Vul… [+121581 chars]"
     },
     {
          "title": "U.S. CISA adds Microsoft Windows CLFS driver flaw to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Microsoft Windows Common Log File System (CLFS) driver flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the Microsoft …",
          "url": "https://securityaffairs.com/171851/hacking/u-s-cisa-adds-microsoft-windows-clfs-driver-flaw-to-its-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds Microsoft Windows CLFS driver flaw to its Known Exploited Vulnerabilities catalog\r\n | Microsoft December 2024 Patch Tuesday addressed actively exploited zero-day\r\n | SAP fixed critical… [+122423 chars]"
     },
     {
          "title": "Security Affairs newsletter Round 501 by Pierluigi Paganini – INTERNATIONAL EDITION",
          "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. RedLine info-s…",
          "url": "https://securityaffairs.com/171789/breaking-news/security-affairs-newsletter-round-501-by-pierluigi-paganini-international-edition.html",
          "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 23\r\n | Security Affairs newsletter Round 501 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | RedLine info-stealer campaign targets Russian businesses through… [+121871 chars]"
     },
     {
          "title": "SECURITY AFFAIRS MALWARE NEWSLETTER – ROUND 23",
          "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape. SmokeLoader Attack Targets Companies in Taiwan LogoFAIL Exploited to Deploy Bootkitty, the first UEFI bootkit for Linux     …",
          "url": "https://securityaffairs.com/171794/malware/security-affairs-malware-newsletter-round-23.html",
          "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 23\r\n | Security Affairs newsletter Round 501 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | RedLine info-stealer campaign targets Russian businesses through… [+121871 chars]"
     },
     {
          "title": "Deloitte denied its systems were hacked by Brain Cipher ransomware group",
          "description": "Deloitte has responded to claims by the Brain Cipher ransomware group, which alleges the theft of over 1 terabyte of the company’s data. Recently, the ransomware group Brain Cipher added Deloitte UK to its Tor leak site. The gang claimed to have stolen one te…",
          "url": "https://securityaffairs.com/171827/uncategorized/deloitte-denied-its-systems-were-hacked-by-brain-cipher-ransomware-group.html",
          "content": "Deloitte denied its systems were hacked by Brain Cipher ransomware group\r\n | Mandiant devised a technique to bypass browser isolation using QR codes\r\n | 2023 Anna Jaques Hospital data breach impacted… [+122095 chars]"
     },
     {
          "title": "Mandiant devised a technique to bypass browser isolation using QR codes",
          "description": "Mandiant revealed a technique to bypass browser isolation using QR codes, enabling command transmission from C2 servers. Browser isolation is a security measure that separates web browsing from the user’s device by running the browser in a secure environment …",
          "url": "https://securityaffairs.com/171809/hacking/bypass-browser-isolation-using-qr-codes.html",
          "content": "Mandiant devised a technique to bypass browser isolation using QR codes\r\n | 2023 Anna Jaques Hospital data breach impacted over 310,000 people\r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 23\r\n | Sec… [+122018 chars]"
     },
     {
          "title": "Hundred of CISCO switches impacted by bootloader flaw",
          "description": "A bootloader vulnerability in Cisco NX-OS affects 100+ switches, allowing attackers to bypass image signature checks. Cisco released security patches for a vulnerability, tracked as CVE-2024-20397 (CVSS score of 5.2), in the NX-OS software’s bootloader that c…",
          "url": "https://securityaffairs.com/171729/security/cisco-switches-bootloader-flaw-cve-2024-20397.html",
          "content": "Hundred of CISCO switches impacted by bootloader flaw\r\n | Operation Destabilise dismantled Russian money laundering networks\r\n | Russia-linked APT Secret Blizzard spotted using infrastructure of othe… [+121357 chars]"
     },
     {
          "title": "PUMAKIT, a sophisticated rootkit that uses advanced stealth mechanisms",
          "description": "Researchers discovered PUMAKIT, a Linux rootkit capable of hiding files, escalating privileges, and evading system tools and detection. Elastic Security Lab researchers discovered a new loadable kernel module (LKM) rootkit called PUMAKIT that supports advance…",
          "url": "https://securityaffairs.com/172016/malware/pumakit-sophisticated-rootkit.html",
          "content": "PUMAKIT, a sophisticated rootkit that uses advanced stealth mechanisms \r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 24\r\n | Security Affairs newsletter Round 502 by Pierluigi Paganini INTERNATIONAL … [+123687 chars]"
     },
     {
          "title": "U.S. Court rules against NSO Group in WhatsApp spyware Lawsuit",
          "description": "A U.S. court ruled in favor of WhatsApp against NSO Group, holding the spyware vendor liable for exploiting a flaw to deliver Pegasus spyware. WhatsApp won a legal case against NSO Group in a U.S. court over exploiting a vulnerability to deliver Pegasus spywa…",
          "url": "https://securityaffairs.com/172247/laws-and-regulations/u-s-court-rules-against-nso-group-whatsapp-lawsuit.html",
          "content": "U.S. Court rules against NSO Group in WhatsApp spyware Lawsuit\r\n | Lazarus APT targeted employees at an unnamed nuclear-related organization\r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 25\r\n | Secur… [+125604 chars]"
     },
     {
          "title": "The FBI warns of HiatusRAT scanning campaigns against Chinese-branded web cameras and DVRs",
          "description": "The FBI warned of a fresh wave of HiatusRAT malware attacks targeting internet-facing Chinese-branded web cameras and DVRs. The Federal Bureau of Investigation (FBI) released a Private Industry Notification (PIN) to warn of HiatusRAT malware campaigns targeti…",
          "url": "https://securityaffairs.com/172074/malware/fbi-warns-of-hiatusrat-scanning-campaigns.html",
          "content": "The FBI warns of HiatusRAT scanning campaigns against Chinese-branded web cameras and DVRs\r\n | Russia FSB relies on Ukrainian minors for criminal activities disguised as \"quest games\"\r\n | U.S. CISA a… [+124250 chars]"
     },
     {
          "title": "US considers banning TP-Link routers over cybersecurity concerns",
          "description": "The U.S. government may ban TP-Link routers in 2025 if investigations confirm their use could pose a national security risk. The U.S. government is investigating whether TP-Link routers, linked to cyberattacks, pose a national security risk, the Wall Street J…",
          "url": "https://securityaffairs.com/172128/uncategorized/us-considers-banning-tp-link-routers.html",
          "content": "US considers banning TP-Link routers over cybersecurity concerns\r\n | Russia-linked APT29 group used red team tools in rogue RDP attacks\r\n | Threat actors are attempting to exploit Apache Struts vulne… [+124637 chars]"
     },
     {
          "title": "Texas Tech University data breach impacted 1.4 million individuals",
          "description": "Texas Tech University reports a data breach affecting 1.4 million, exposing personal, health, and financial data from its health sciences centers. Texas Tech University disclosed a data breach that impacted over 1.4 million individuals following a cyber attac…",
          "url": "https://securityaffairs.com/172085/data-breach/texas-tech-university-data-breach.html",
          "content": "Texas Tech University data breach impacted 1.4 million individuals\r\n | The FBI warns of HiatusRAT scanning campaigns against Chinese-branded web cameras and DVRs\r\n | Russia FSB relies on Ukrainian mi… [+124321 chars]"
     },
     {
          "title": "Russia-linked APT Secret Blizzard spotted using infrastructure of other threat actors",
          "description": "Russia-linked APT group Secret Blizzard has used the tools and infrastructure of at least 6 other threat actors during the past 7 years. Researchers from Microsoft Threat Intelligence collected evidence that the Russia-linked ATP group Secret Blizzard (aka Tu…",
          "url": "https://securityaffairs.com/171699/apt/secret-blizzard-using-infrastructure-of-other-threat-actors.html",
          "content": "Russia-linked APT Secret Blizzard spotted using infrastructure of other threat actors\r\n | China-linked APT Salt Typhoon has breached telcos in dozens of countries\r\n | Black Basta ransomware gang hit … [+121228 chars]"
     },
     {
          "title": "U.S. CISA adds CyberPanel flaw to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds CyberPanel flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the CyberPanel flaw CVE-2024-51378 (CVSS score: 10.0) to i…",
          "url": "https://securityaffairs.com/171736/hacking/u-s-cisa-adds-cyberpanel-flaw-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds CyberPanel flaw to its Known Exploited Vulnerabilities catalog\r\n | Hundred of CISCO switches impacted by bootloader flaw\r\n | Operation Destabilise dismantled Russian money laundering n… [+121439 chars]"
     },
     {
          "title": "Ivanti fixed a maximum severity vulnerability in its CSA solution",
          "description": "Ivanti addressed a critical authentication bypass vulnerability impacting its Cloud Services Appliance (CSA) solution. Ivanti addressed a critical authentication bypass vulnerability, tracked as CVE-2024-11639 (CVSS score of 10), in its Cloud Services Applian…",
          "url": "https://securityaffairs.com/171850/breaking-news/ivanti-maximum-severity-flaw-csa-solution.html",
          "content": "Ivanti fixed a maximum severity vulnerability in its CSA solution\r\n | Operation Digital Eye: China-linked relies on Visual Studio Code Remote Tunnels to spy on Europen entities\r\n | Chinese national c… [+122778 chars]"
     },
     {
          "title": "US charged Dual Russian and Israeli National as LockBit Ransomware developer",
          "description": "US authorities charged a dual Russian and Israeli national for being a developer of the LockBit ransomware group. Rostislav Panev, 51, a dual Russian-Israeli national, was charged as a LockBit ransomware developer. Arrested in Israel, he awaits extradition to…",
          "url": "https://securityaffairs.com/172201/uncategorized/us-authorities-charged-lockbit-ransomware-developer.html",
          "content": "US charged Dual Russian and Israeli National as LockBit Ransomware developer\r\n | BadBox rapidly grows, 190,000 Android devices infected\r\n | Romanian national was sentenced to 20 years in prison for h… [+125324 chars]"
     },
     {
          "title": "ZAGG disclosed a data breach that exposed its customers’ credit card data",
          "description": "ZAGG Inc. notifies customers of credit card data breach, after threat actors hacked a third-party app from its e-commerce provider. ZAGG Inc. disclosed a data breach that exposed its customers’ credit card data after threat actors hacked a third-party applica…",
          "url": "https://securityaffairs.com/172434/data-breach/zagg-credit-card-data-data-breach.html",
          "content": "ZAGG disclosed a data breach that exposed its customers' credit card data\r\n | China-linked APT Salt Typhoon breached a ninth U.S. telecommunications firm\r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND… [+126957 chars]"
     },
     {
          "title": "Threat actors attempt to exploit a flaw in Four-Faith routers",
          "description": "VulnCheck researchers warn that threat actors are attempting to exploit a high-severity vulnerability impacting some Four-Faith routers. Cybersecurity firm VulnCheck warns that a high-severity flaw, tracked as CVE-2024-12856 (CVSS score: 7.2), in Four-Faith r…",
          "url": "https://securityaffairs.com/172450/hacking/four-faith-routers-flaw-exploited.html",
          "content": "Threat actors attempt to exploit a flaw in Four-Faith routers\r\n | ZAGG disclosed a data breach that exposed its customers' credit card data\r\n | China-linked APT Salt Typhoon breached a ninth U.S. tel… [+127023 chars]"
     },
     {
          "title": "SECURITY AFFAIRS MALWARE NEWSLETTER – ROUND 26",
          "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape. Now You See Me, Now You Don’t: Using LLMs to Obfuscate Malicious JavaScript Analyzing Malicious Intent in Python Code: A Cas…",
          "url": "https://securityaffairs.com/172418/uncategorized/security-affairs-malware-newsletter-round-26.html",
          "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 26\r\n | Security Affairs newsletter Round 504 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | Pro-Russia group NoName targeted the websites of Italian airport… [+126799 chars]"
     },
     {
          "title": "North Korea actors use OtterCookie malware in Contagious Interview campaign",
          "description": "North Korea-linked threat actors are using the OtterCookie backdoor to target software developers with fake job offers. North Korea-linked threat actors were spotted using new malware called OtterCookie as part of the Contagious Interview campaign that target…",
          "url": "https://securityaffairs.com/172382/malware/north-korea-linked-actors-using-ottercookie-backdoor.html",
          "content": "North Korea actors use OtterCookie malware in Contagious Interview campaign\r\n | Experts warn of a surge in activity associated FICORA and Kaiten botnets\r\n | Brazilian citizen charged for threatening … [+126594 chars]"
     },
     {
          "title": "Pro-Russia group NoName targeted the websites of Italian airports",
          "description": "Pro-Russia group NoName057 targets Italian sites, including Malpensa and Linate airports, in a new DDoS campaign amid rising geopolitical tensions. The pro-Russia group NoName57 continues its campaign of DDoS attacks against Italian infrastructure. This time,…",
          "url": "https://securityaffairs.com/172395/security/pro-russia-group-noname057-targets-italian-airports.html",
          "content": "Pro-Russia group NoName targeted the websites of Italian airports\r\n | North Korea actors use OtterCookie malware in Contagious Interview campaign\r\n | Experts warn of a surge in activity associated FI… [+126664 chars]"
     },
     {
          "title": "A cyber attack hit Japan Airlines delaying ticket sales for flights",
          "description": "A cyberattack hit Japan Airlines (JAL), causing the suspension of ticket sales for flights departing on Thursday. A cyber attack hit Japan Airlines (JAL) on Thursday, the offensive began at 7:24 a.m. and impacted internal and external systems. The Associated …",
          "url": "https://securityaffairs.com/172319/hacking/japan-airlines-hit-cyberattack.html",
          "content": "A cyber attack hit Japan Airlines delaying ticket sales for flights\r\n | Apache fixed a critical SQL Injection in Apache Traffic Control\r\n | BellaCPP, Charming Kitten's BellaCiao variant written in C+… [+126206 chars]"
     },
     {
          "title": "Cisco states that the second data leak is linked to the one from October",
          "description": "Cisco confirmed the authenticity of the 4GB of leaked data, the data was compromised in a recent security breach, marking the second leak in the incident. Cisco confirmed the authenticity of the 4GB of leaked data, which was compromised in a recent security b…",
          "url": "https://securityaffairs.com/172460/data-breach/cisco-second-data-leak-linked-to-october-one.html",
          "content": "Cisco states that the second data leak is linked to the one from October\r\n | Threat actors attempt to exploit a flaw in Four-Faith routers\r\n | ZAGG disclosed a data breach that exposed its customers'… [+127100 chars]"
     },
     {
          "title": "Lumen reports that it has locked out the Salt Typhoon group from its network",
          "description": "Lumen reports that the Salt Typhoon hacking group, which targeted at least nine U.S. telecom firms, was locked out of its network. This week, a White House official confirmed that China-linked APT group Salt Typhoon has breached a ninth U.S. telecoms company …",
          "url": "https://securityaffairs.com/172544/apt/lumen-locked-out-salt-typhoon.html",
          "content": "Lumen reports that it has locked out the Salt Typhoon group from its network\r\n | Proposed updates to HIPAA Security Rule mandate to restore the loss of certain relevant electronic information systems… [+127666 chars]"
     },
     {
          "title": "Three Russian-German nationals charged with suspicion of secret service agent activity",
          "description": "German authorities have charged three Russian-German nationals with suspicion of, among other things, secret service agent activity for the Russian government. German authorities have charged three Russian-German nationals on suspicion of activities including…",
          "url": "https://securityaffairs.com/172559/intelligence/russian-german-nationals-charged-secret-service-agent-activity.html",
          "content": "Three Russian-German nationals charged with suspicion of secret service agent activity\r\n | Lumen reports that it has locked out the Salt Typhoon group from its network\r\n | Proposed updates to HIPAA S… [+127757 chars]"
     },
     {
          "title": "Black Basta ransomware gang hit BT Group",
          "description": "BT Group (formerly British Telecom)’s Conferencing division shut down some of its servers following a Black Basta ransomware attack. British multinational telecommunications holding company BT Group (formerly British Telecom) announced it has shut down some o…",
          "url": "https://securityaffairs.com/171668/breaking-news/black-basta-ransomware-attack-bt-group.html",
          "content": "Black Basta ransomware gang hit BT Group\r\n | Authorities shut down Crimenetwork, the Germany's largest crime marketplace\r\n | Veeam addressed critical Service Provider Console (VSPC) bug\r\n | Australia… [+121061 chars]"
     },
     {
          "title": "Microsoft December 2024 Patch Tuesday addressed actively exploited zero-day",
          "description": "Microsoft December 2024 Patch Tuesday security updates addressed 71 vulnerabilities including an actively exploited zero-day. Microsoft December 2024 Patch Tuesday security updates addressed 71 vulnerabilities in Windows and Windows Components, Office and Off…",
          "url": "https://securityaffairs.com/171845/security/microsoft-december-2024-patch-tuesday.html",
          "content": "Microsoft December 2024 Patch Tuesday addressed actively exploited zero-day\r\n | SAP fixed critical SSRF flaw in NetWeaver's Adobe Document Services\r\n | Romanian energy supplier Electrica Group is fac… [+122322 chars]"
     },
     {
          "title": "SAP fixed critical SSRF flaw in NetWeaver’s Adobe Document Services",
          "description": "SAP has issued patches for 16 vulnerabilities, including a critical SSRF flaw in NetWeaver’s Adobe Document Services. SAP addressed 16 vulnerabilities as part of its December 2024 Security Patch Day. The company released nine new and four updated security not…",
          "url": "https://securityaffairs.com/171839/security/sap-fixed-critical-ssrf-flaw-netweaver.html",
          "content": "SAP fixed critical SSRF flaw in NetWeaver NetWeaver's Adobe Document Services\r\n | Romanian energy supplier Electrica Group is facing a ransomware attack\r\n | Deloitte denied its systems were hacked by… [+122252 chars]"
     },
     {
          "title": "Multiple flaws in Volkswagen Group’s infotainment unit allow for vehicle compromise",
          "description": "Researchers discovered multiple flaws in the infotainment systems of Volkswagen Group vehicles that could allow to track them in real-time. A team of security researchers from cybersecurity firm PCAutomotive discovered multiple vulnerabilities in the infotain…",
          "url": "https://securityaffairs.com/172024/hacking/volkswagen-group-infotainment-unit-flaws.html",
          "content": "Multiple flaws in Volkswagen Group's infotainment unit allow for vehicle compromise\r\n | PUMAKIT, a sophisticated rootkit that uses advanced stealth mechanisms \r\n | SECURITY AFFAIRS MALWARE NEWSLETTER… [+123775 chars]"
     },
     {
          "title": "IOCONTROL cyberweapon used to target infrastructure in the US and Isreael",
          "description": "Iran-linked threat actors target IoT and OT/SCADA systems in US and Israeli infrastructure with IOCONTROL malware. Claroty’s Team82 obtained a sample of a custom-built IoT/OT malware called IOCONTROL used by the Iran-linked threat actors to target devices in …",
          "url": "https://securityaffairs.com/171980/malware/iocontrol-cyberweapon-targets-us-isreael.html",
          "content": "IOCONTROL cyberweapon used to target infrastructure in the US and Isreael\r\n | U.S. CISA adds Cleo Harmony, VLTrader, and LexiCom flaw to its Known Exploited Vulnerabilities catalog\r\n | German agency … [+123476 chars]"
     },
     {
          "title": "SECURITY AFFAIRS MALWARE NEWSLETTER – ROUND 24",
          "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape. PROXY.AM Powered by Socks5Systemz Botnet  AppLite: A New AntiDot Variant Targeting Mobile Employee Devices   Inside Zloader’…",
          "url": "https://securityaffairs.com/172002/malware/security-affairs-malware-newsletter-round-24.html",
          "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 24\r\n | Security Affairs newsletter Round 502 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | IOCONTROL cyberweapon used to target infrastructure in the US an… [+123611 chars]"
     },
     {
          "title": "US Bitcoin ATM operator Byte Federal suffered a data breach",
          "description": "US Bitcoin ATM operator Byte Federal suffered a data breach impacting 58,000 customers, attackers gained unauthorized access to a server via GitLab flaw. US Bitcoin ATM operator Byte Federal disclosed a data breach after threat actors gained unauthorized acce…",
          "url": "https://securityaffairs.com/171941/data-breach/us-bitcoin-atm-operator-byte-federal-suffered-a-data-breach.html",
          "content": "US Bitcoin ATM operator Byte Federal suffered a data breach\r\n | Experts discovered surveillance tool EagleMsgSpy used by Chinese law enforcement\r\n | Operation PowerOFF took down 27 DDoS platforms acr… [+123068 chars]"
     },
     {
          "title": "ConnectOnCall data breach impacted over 900,000 individuals",
          "description": "ConnectOnCall disclosed a data breach impacting over 900,000 individuals, exposing their personal information. ConnectOnCall is a telehealth platform and after-hours on-call answering service designed to enhance communication between healthcare providers and …",
          "url": "https://securityaffairs.com/172053/data-breach/connectoncall-data-breach-impacted-over-900000-individuals.html",
          "content": "ConnectOnCall data breach impacted over 900,000 individuals\r\n | Report claims that Serbian authorities abused Cellebrite tool to install NoviSpy spyware\r\n | Multiple flaws in Volkswagen Group's infot… [+123932 chars]"
     },
     {
          "title": "New Atrium Health data breach impacts 585,000 individuals",
          "description": "Atrium Health disclosed a data breach affecting 585,000 individuals to the HHS, potentially linked to the use of online tracking tools. Healthcare company Atrium Health disclosed a data breach that impacted 585,000 individuals. The company notified the US Dep…",
          "url": "https://securityaffairs.com/171747/data-breach/atrium-health-disclosed-a-data-breach.html",
          "content": "New Atrium Health data breach impacts 585,000 individuals\r\n | U.S. CISA adds CyberPanel flaw to its Known Exploited Vulnerabilities catalog\r\n | Hundred of CISCO switches impacted by bootloader flaw\r\n… [+121501 chars]"
     },
     {
          "title": "Romania ’s election systems hit by 85,000 attacks ahead of presidential vote",
          "description": "Romania ‘s election systems suffered over 85,000 attacks, with leaked credentials posted on a Russian hacker forum before the presidential election. Romania ‘s Intelligence Service revealed that over 85,000 cyberattacks targeted the country’s election systems…",
          "url": "https://securityaffairs.com/171758/cyber-warfare-2/romanias-election-systems-hit-by-85000-attacks.html",
          "content": "Romania s election systems hit by 85,000 attacks ahead of presidential vote\r\n | New Atrium Health data breach impacts 585,000 individuals\r\n | U.S. CISA adds CyberPanel flaw to its Known Exploited Vul… [+121581 chars]"
     },
     {
          "title": "8Base ransomware group hacked Croatia’s Port of Rijeka",
          "description": "The 8Base ransomware group attacked Croatia’s Port of Rijeka, stealing sensitive data, including contracts and accounting info. A cyber attack hit the Port of Rijeka in Croatia, the 8Base ransomware group claimed responsibility for the security breach. The Po…",
          "url": "https://securityaffairs.com/171779/cyber-crime/8base-ransomware-croatias-port-of-rijeka.html",
          "content": "8Base ransomware group hacked Croatia's Port of Rijeka\r\n | Romania s election systems hit by 85,000 attacks ahead of presidential vote\r\n | New Atrium Health data breach impacts 585,000 individuals\r\n … [+121640 chars]"
     },
     {
          "title": "Apache Foundation fixed a severe Tomcat vulnerability",
          "description": "The Apache Software Foundation fixed a Tomcat server software flaw that could lead to remote code execution under certain conditions. The Apache Software Foundation (ASF) addressed an important vulnerability, tracked as CVE-2024-56337, in its Tomcat server so…",
          "url": "https://securityaffairs.com/172273/security/apache-foundation-fixed-tomcat-flaw.html",
          "content": "Apache Foundation fixed a severe Tomcat vulnerability\r\n | Italy's data protection watchdog fined OpenAI 15 million over ChatGPTs data management violations\r\n | U.S. CISA adds Acclaim Systems USAHERDS… [+125860 chars]"
     },
     {
          "title": "Lazarus APT targeted employees at an unnamed nuclear-related organization",
          "description": "North Korea-linked Lazarus Group targeted employees of an unnamed nuclear-related organization in January 2024. Kaspersky researchers observed the North Korea-linked Lazarus Group targeting at least two employees associated with the same nuclear-related organ…",
          "url": "https://securityaffairs.com/172221/apt/lazarus-apt-targeted-employees-unnamed-nuclear-related-org.html",
          "content": "Lazarus APT targeted employees at an unnamed nuclear-related organization\r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 25\r\n | Security Affairs newsletter Round 503 by Pierluigi Paganini INTERNATIONA… [+125537 chars]"
     },
     {
          "title": "A new Mirai botnet variant targets DigiEver DS-2105 Pro DVRs",
          "description": "Akamai researchers discovered a new Mirai botnet variant targeting a vulnerability in DigiEver DS-2105 Pro DVRs. Akamai researchers spotted a Mirai-based botnet that is exploiting an remote code execution vulnerability in DigiEver DS-2105 Pro NVRs. The expert…",
          "url": "https://securityaffairs.com/172345/malware/mirai-botnet-targets-digiever-ds-2105-pro-dvrs.html",
          "content": "A new Mirai botnet variant targets DigiEver DS-2105 Pro DVRs\r\n | A ransomware attack disrupted services at Pittsburgh Regional Transit\r\n | A cyber attack hit Japan Airlines delaying ticket sales for … [+126345 chars]"
     },
     {
          "title": "Palo Alto Networks fixed a high-severity PAN-OS flaw",
          "description": "Palo Alto Networks addressed a high-severity PAN-OS flaw that could trigger denial-of-service (DoS) on vulnerable devices. Palo Alto Networks addressed a high-severity flaw, tracked as CVE-2024-3393 (CVSS score: 8.7), in PAN-OS software that could cause a den…",
          "url": "https://securityaffairs.com/172370/security/palo-alto-networks-high-severity-pan-os-flaw.html",
          "content": "Brazilian citizen charged for threatening to release data stolen from a company in 2020\r\n | A new Mirai botnet variant targets DigiEver DS-2105 Pro DVRs\r\n | A ransomware attack disrupted services at … [+126437 chars]"
     },
     {
          "title": "China-linked APT Salt Typhoon breached a ninth U.S. telecommunications firm",
          "description": "A White House official confirmed that China-linked threat actor Salt Typhoon breached a ninth U.S. telecommunications company. A White House official confirmed confirmed that China-linked APT group Salt Typhoon has breached a ninth U.S. telecoms company as pa…",
          "url": "https://securityaffairs.com/172425/apt/salt-typhoon-breached-ninth-u-s-telco.html",
          "content": "China-linked APT Salt Typhoon breached a ninth U.S. telecommunications firm\r\n | SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 26\r\n | Security Affairs newsletter Round 504 by Pierluigi Paganini INTERNATIO… [+126879 chars]"
     },
     {
          "title": "Experts discovered the first mobile malware families linked to Russia’s Gamaredon",
          "description": "The Russia-linked APT Gamaredon used two new Android spyware tools called BoneSpy and PlainGnome against former Soviet states. Lookout researchers linked the BoneSpy and PlainGnome Android surveillance families to the Russian APT group Gamaredon (a.k.a. Armag…",
          "url": "https://securityaffairs.com/171949/apt/gamaredon-used-two-new-android-spyware-tools.html",
          "content": "Experts discovered the first mobile malware families linked to Russia's Gamaredon\r\n | US Bitcoin ATM operator Byte Federal suffered a data breach\r\n | Experts discovered surveillance tool EagleMsgSpy … [+123154 chars]"
     },
     {
          "title": "Operation Digital Eye: China-linked relies on Visual Studio Code Remote Tunnels to spy on Europen entities",
          "description": "An alleged China-linked APT group targeted large business-to-business IT service providers in Southern Europe as part of Operation Digital Eye campaign. Between late June and mid-July 2024, a China-linked threat actor targeted major IT service providers in So…",
          "url": "https://securityaffairs.com/171879/apt/operation-digital-china-apt-targets-europe.html",
          "content": "Operation Digital Eye: China-linked relies on Visual Studio Code Remote Tunnels to spy on Europen entities\r\n | Chinese national charged for hacking thousands of Sophos firewalls\r\n | Cybercriminals Im… [+122708 chars]"
     },
     {
          "title": "Deloitte denied its systems were hacked by Brain Cipher ransomware group",
          "description": "Deloitte has responded to claims by the Brain Cipher ransomware group, which alleges the theft of over 1 terabyte of the company’s data. Recently, the ransomware group Brain Cipher added Deloitte UK to its Tor leak site. The gang claimed to have stolen one te…",
          "url": "https://securityaffairs.com/171827/cyber-crime/deloitte-denied-its-systems-were-hacked-by-brain-cipher-ransomware-group.html",
          "content": "Russia's Secret Blizzard APT targets Ukraine with Kazuar backdoor\r\n | Ivanti fixed a maximum severity vulnerability in its CSA solution\r\n | Operation Digital Eye: China-linked relies on Visual Studio… [+122848 chars]"
     },
     {
          "title": "Russia’s Secret Blizzard APT targets Ukraine with Kazuar backdoor",
          "description": "Russia-linked APT group Secret Blizzard is using Amadey Malware-as-a-Service to infect systems in Ukraine with the Kazuar backdoor. The Russia-linked APT group Secret Blizzard (aka Turla, Snake, Uroburos, Waterbug, Venomous Bear and KRYPTON) was spotted using…",
          "url": "https://securityaffairs.com/171896/apt/secret-blizzard-targets-ukraine-with-kazuar-backdoor.html",
          "content": "Russia's Secret Blizzard APT targets Ukraine with Kazuar backdoor\r\n | Ivanti fixed a maximum severity vulnerability in its CSA solution\r\n | Operation Digital Eye: China-linked relies on Visual Studio… [+122848 chars]"
     },
     {
          "title": "U.S. CISA adds BeyondTrust software flaw to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds BeyondTrust Privileged Remote Access (PRA) and Remote Support (RS) Command Injection flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agen…",
          "url": "https://securityaffairs.com/172170/security/us-cisa-beyondtrust-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds BeyondTrust software flaw to its Known Exploited Vulnerabilities catalog\r\n | Raccoon Infostealer operator sentenced to 60 months in prison\r\n | Mirai botnet targets SSR devices, Juniper… [+125015 chars]"
     },
     {
          "title": "Russia-linked APT29 group used red team tools in rogue RDP attacks",
          "description": "Russia-linked APT29 group uses malicious RDP configuration files, adapting red teaming methods for cyberattacks to compromise systems. In October 2024, the Russia-linked cyber espionage group APT29 (aka Earth Koshchei, SVR group, Cozy Bear, Nobelium, BlueBrav…",
          "url": "https://securityaffairs.com/172117/apt/russian-apt29-group-uses-rogue-rdp.html",
          "content": "Russia-linked APT29 group used red team tools in rogue RDP attacks\r\n | Threat actors are attempting to exploit Apache Struts vulnerability CVE-2024-53677\r\n | Irish Data Protection Commission (DPC) fi… [+124568 chars]"
     },
     {
          "title": "CERT-UA: Russia-linked UAC-0125 abuses Cloudflare Workers to target Ukrainian army",
          "description": "The Computer Emergency Response Team of Ukraine (CERT-UA) warns that the threat actor UAC-0125 abuses Cloudflare Workers services to target the Ukrainian army with Malware. The Computer Emergency Response Team of Ukraine (CERT-UA) warns that the threat actor …",
          "url": "https://securityaffairs.com/172139/apt/cert-ua-warns-russia-uac-0125-abuses-cloudflare-workers.html",
          "content": "CERT-UA: Russia-linked UAC-0125 abuses Cloudflare Workers to target Ukrainian army\r\n | US considers banning TP-Link routers over cybersecurity concerns\r\n | Russia-linked APT29 group used red team too… [+124724 chars]"
     },
     {
          "title": "U.S. CISA adds Acclaim Systems USAHERDS flaw to its Known Exploited Vulnerabilities catalog",
          "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Acclaim Systems USAHERDS flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added an Acclaim Systems USAHERDS vulnerability, t…",
          "url": "https://securityaffairs.com/172255/hacking/u-s-cisa-acclaim-systems-usaherds-flaw-known-exploited-vulnerabilities-catalog.html",
          "content": "U.S. CISA adds Acclaim Systems USAHERDS flaw to its Known Exploited Vulnerabilities catalog\r\n | U.S. Court rules against NSO Group in WhatsApp spyware Lawsuit\r\n | Lazarus APT targeted employees at an… [+125700 chars]"
     },
     {
          "title": "Italy’s data protection watchdog fined OpenAI €15 million over ChatGPT’s data management violations",
          "description": "Italy’s data protection watchdog fined OpenAI €15 million for ChatGPT’s improper collection of personal data. Italy’s privacy watchdog, Garante Privacy, fined OpenAI €15M after investigating ChatGPT’s personal data collection practices. The Italian Garante Pr…",
          "url": "https://securityaffairs.com/172264/laws-and-regulations/italys-data-protection-watchdog-fined-openai-e15-million.html",
          "content": "Italy's data protection watchdog fined OpenAI 15 million over ChatGPTs data management violations\r\n | U.S. CISA adds Acclaim Systems USAHERDS flaw to its Known Exploited Vulnerabilities catalog\r\n | U… [+125802 chars]"
     },
     {
          "title": "BellaCPP, Charming Kitten’s BellaCiao variant written in C++",
          "description": "Iran-linked APT group Charming Kitten has been observed using a new variant of the BellaCiao malware dubbed BellaCPP, Kaspersky researchers warn. The Iran-linked APT group Charming Kitten has been observed using a C++ variant of the BellaCiao malware, dubbed …",
          "url": "https://securityaffairs.com/172299/malware/bellacpp-charming-kittens-bellaciao-variant-written-in-c.html",
          "content": "BellaCPP, Charming Kitten's BellaCiao variant written in C++\r\n | DMM Bitcoin $308M Bitcoin heist linked to North Korea\r\n | Adobe is aware that ColdFusion bug CVE-2024-53961 has a known PoC exploit co… [+126066 chars]"
     },
     {
          "title": "Apache fixed a critical SQL Injection in Apache Traffic Control",
          "description": "Apache Software Foundation (ASF) addressed a critical SQL Injection vulnerability, tracked as CVE-2024-45387, in Apache Traffic Control. The Apache Software Foundation (ASF) released security updates to address a critical security vulnerability, tracked as CV…",
          "url": "https://securityaffairs.com/172307/security/apache-traffic-control-critical-flaw.html",
          "content": "Apache fixed a critical SQL Injection in Apache Traffic Control\r\n | BellaCPP, Charming Kitten's BellaCiao variant written in C++\r\n | DMM Bitcoin $308M Bitcoin heist linked to North Korea\r\n | Adobe is… [+126134 chars]"
     },
     {
          "title": "Adobe is aware that ColdFusion bug CVE-2024-53961 has a known PoC exploit code",
          "description": "Adobe released out-of-band security updates to address a critical ColdFusion vulnerability, experts warn of a PoC exploit code available for it. Adobe released out-of-band security updates to address a critical vulnerability, tracked as CVE-2024-53961 (CVSS s…",
          "url": "https://securityaffairs.com/172281/security/adobe-coldfusion-flaw-poc.html",
          "content": "Adobe is aware that ColdFusion bug CVE-2024-53961 has a known PoC exploit code\r\n | Apache Foundation fixed a severe Tomcat vulnerability\r\n | Italy's data protection watchdog fined OpenAI 15 million o… [+125943 chars]"
     },
     {
          "title": "Burnout in SOCs: How AI Can Help Analysts Focus on High-Value Tasks",
          "description": "SOC analysts, vital to cybersecurity, face burnout due to exhausting workloads, risking their well-being and the effectiveness of organizational defenses. Security Operations Center (SOC) analyst burnout is a very real problem. These are some of the most impo…",
          "url": "https://securityaffairs.com/171724/security/burnout-in-socs-how-ai-can-help-analysts-focus-on-high-value-tasks.html",
          "content": "Operation Destabilise dismantled Russian money laundering networks\r\n | Russia-linked APT Secret Blizzard spotted using infrastructure of other threat actors\r\n | China-linked APT Salt Typhoon has brea… [+121299 chars]"
     },
     {
          "title": "Experts discovered surveillance tool EagleMsgSpy used by Chinese law enforcement",
          "description": "Chinese law enforcement uses the mobile surveillance tool EagleMsgSpy to gather data from Android devices, as detailed by Lookout. Researchers at the Lookout Threat Lab discovered a surveillance tool, dubbed EagleMsgSpy, used by Chinese law enforcement to spy…",
          "url": "https://securityaffairs.com/171904/malware/china-uses-eaglemsgspy-malware.html",
          "content": "Experts discovered surveillance tool EagleMsgSpy used by Chinese law enforcement\r\n | Operation PowerOFF took down 27 DDoS platforms across 15 countries\r\n | Russia's Secret Blizzard APT targets Ukrain… [+123004 chars]"
     },
     {
          "title": "U.S. authorities seized cybercrime marketplace Rydox",
          "description": "The U.S. Department of Justice (DoJ) announced the seizure of the cybercrime marketplace Rydox (“rydox.ru” and “rydox[.]cc”). The U.S. Department of Justice (DoJ) seized Rydox, a cybercrime marketplace for selling stolen personal data and fraud tools. Kosovar…",
          "url": "https://securityaffairs.com/171956/cyber-crime/u-s-authorities-seized-marketplace-rydox.html",
          "content": "U.S. authorities seized cybercrime marketplace Rydox\r\n | Experts discovered the first mobile malware families linked to Russia's Gamaredon\r\n | US Bitcoin ATM operator Byte Federal suffered a data bre… [+123211 chars]"
     },
     {
          "title": "The Mask APT is back after 10 years of silence",
          "description": "Kaspersky researchers linked a new wave of cyber attacks to the cyber espionage group tracked as The Mask. Kaspersky researchers linked several targeted attacks to a cyber espionage group known as The Mask. The APT group targeted an organization in Latin Amer…",
          "url": "https://securityaffairs.com/172093/apt/the-mask-apt-is-back.html",
          "content": "Irish Data Protection Commission (DPC) fined Meta 251 million for a 2018 data breach\r\n | Texas Tech University data breach impacted 1.4 million individuals\r\n | The FBI warns of HiatusRAT scanning cam… [+124410 chars]"
     },
     {
          "title": "Irish Data Protection Commission (DPC) fined Meta €251 million for a 2018 data breach",
          "description": "Meta has been fined €251M ($263M) for a 2018 data breach affecting millions in the EU, marking another penalty for violating privacy laws. The Irish Data Protection Commission (DPC) fined Meta €251 million ($263M) for a 2018 data breach impacting 29 million F…",
          "url": "https://securityaffairs.com/172100/laws-and-regulations/dpc-fined-meta-e251-million.html",
          "content": "Irish Data Protection Commission (DPC) fined Meta 251 million for a 2018 data breach\r\n | Texas Tech University data breach impacted 1.4 million individuals\r\n | The FBI warns of HiatusRAT scanning cam… [+124410 chars]"
     },
     {
          "title": "Threat actors are attempting to exploit Apache Struts vulnerability CVE-2024-53677",
          "description": "Researchers warn that threat actors are attempting to exploit a recently disclosed Apache Struts vulnerability CVE-2024-53677. Researchers warn that threat actors are attempting to exploit the vulnerability CVE-2024-53677 (CVSS score of 9.5) in Apache Struts.…",
          "url": "https://securityaffairs.com/172109/hacking/apache-struts-vulnerability-cve-2024-53677-flaw.html",
          "content": "Threat actors are attempting to exploit Apache Struts vulnerability CVE-2024-53677\r\n | Irish Data Protection Commission (DPC) fined Meta 251 million for a 2018 data breach\r\n | Texas Tech University d… [+124497 chars]"
     },
     {
          "title": "Fortinet warns about Critical flaw in Wireless LAN Manager FortiWLM",
          "description": "Fortinet warns of a patched FortiWLM vulnerability that could allow admin access and sensitive information disclosure. Fortinet warned of a now-patched Wireless LAN Manager (FortiWLM) vulnerability, tracked as CVE-2023-34990 (CVSS score of 9.6), that could le…",
          "url": "https://securityaffairs.com/172144/hacking/fortinet-warns-of-a-patched-fortiwlm-vulnerability.html",
          "content": "Fortinet warns about Critical flaw in Wireless LAN Manager FortiWLM\r\n | CERT-UA: Russia-linked UAC-0125 abuses Cloudflare Workers to target Ukrainian army\r\n | US considers banning TP-Link routers ove… [+124796 chars]"
     },
     {
          "title": "BadBox rapidly grows, 190,000 Android devices infected",
          "description": "Experts uncovered a botnet of 190,000 Android devices infected by BadBox bot, primarily Yandex smart TVs and Hisense smartphones. Bitsight researchers uncovered new BADBOX infrastructure, company’s telemetry shows that over 192,000 devices were infected with …",
          "url": "https://securityaffairs.com/172191/malware/190000-android-devices-infected-by-badbox.html",
          "content": "BadBox rapidly grows, 190,000 Android devices infected\r\n | Romanian national was sentenced to 20 years in prison for his role in NetWalker ransomware attacks\r\n | Sophos fixed critical vulnerabilities… [+125243 chars]"
     },
     {
          "title": "Security Affairs newsletter Round 503 by Pierluigi Paganini – INTERNATIONAL EDITION",
          "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. BadBox rapidly…",
          "url": "https://securityaffairs.com/172208/breaking-news/security-affairs-newsletter-round-503-by-pierluigi-paganini-international-edition.html",
          "content": "Security Affairs newsletter Round 503 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | US charged Dual Russian and Israeli National as LockBit Ransomware developer\r\n | BadBox rapidly grows, 190,000 An… [+125410 chars]"
     },
     {
          "title": "SECURITY AFFAIRS MALWARE NEWSLETTER – ROUND 25",
          "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape. Vishing via Microsoft Teams Facilitates DarkGate Malware Intrusion   Spyware distributed through Amazon Appstore   BADBOX Bo…",
          "url": "https://securityaffairs.com/172214/breaking-news/security-affairs-malware-newsletter-round-25.html",
          "content": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 25\r\n | Security Affairs newsletter Round 503 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | US charged Dual Russian and Israeli National as LockBit Ransomwa… [+125459 chars]"
     },
     {
          "title": "Sophos fixed critical vulnerabilities in its Firewall product",
          "description": "Sophos fixed three Sophos Firewall flaws that could lead to SQL injection, privileged SSH access to devices, and remote code execution. Sophos has addressed three vulnerabilities, respectively tracked as CVE-2024-12727, CVE-2024-12728, and CVE-2024-12729, in …",
          "url": "https://securityaffairs.com/172179/security/sophos-firewall-critical-vulnerabilities.html",
          "content": "Sophos fixed critical vulnerabilities in its Firewall product\r\n | U.S. CISA adds BeyondTrust software flaw to its Known Exploited Vulnerabilities catalog\r\n | Raccoon Infostealer operator sentenced to… [+125081 chars]"
     },
     {
          "title": "Rhode Island ’s data from health benefits system leaked on the dark web",
          "description": "Rhode Island ’s health benefits system was hacked, and threat actors leaked residents’ data on the dark web. Cybercriminals leaked data stolen from Rhode Island ‘s health benefits system on the dark web. Gov. Daniel McKee stated the state had prepared for thi…",
          "url": "https://securityaffairs.com/172503/cyber-crime/rhode-island-data-breach.html",
          "content": "Rhode Island s data from health benefits system leaked on the dark web\r\n | Hacking campaign compromised at least 16 Chrome browser extensions\r\n | An X user claimed a 7-Zip zero-day vulnerability, but… [+127335 chars]"
     },
     {
          "title": "It’s Becoming Harder to Protest Gaza War on Campus — and Also to Teach About It",
          "description": "Organizing for labor protections and academic freedom is crucial to combat higher education’s creeping authoritarianism.",
          "url": "https://truthout.org/articles/its-becoming-harder-to-protest-gaza-war-on-campus-and-also-to-teach-about-it/",
          "content": "Part of the Series\r\nOn a crisp November morning in Ithaca, New York, scores of young people gathered on the sidewalk to cheer their classmate, Sriram Parasurama, a second-year doctoral student in hor… [+21824 chars]"
     },
     {
          "title": "US, Chinese Ships At Cambodia Bases As Washington Navigates Diplomatic Currents",
          "description": "When a US warship docked in Cambodia this week, it moored just a few kilometres from a base where China has built an extended new pier and two of Beijing's own vessels have been berthed for about a year.",
          "url": "https://www.ibtimes.com/us-chinese-ships-cambodia-bases-washington-navigates-diplomatic-currents-3755970",
          "content": "When a US warship docked in Cambodia this week, it moored just a few kilometres from a base where China has built an extended new pier and two of Beijing's own vessels have been berthed for about a y… [+3948 chars]"
     },
     {
          "title": "Is the U.S. Answer to China’s Belt and Road Working?",
          "description": "The International Development Finance Corporation has put the United States more on the map, but China remains king of global infrastructure.",
          "url": "https://foreignpolicy.com/2024/12/16/dfc-investment-africa-china-bri-lobito-corridor-infrastructure-development/",
          "content": "U.S. President Joe Biden combined two of his passions during his much-delayed trip to Africa last week: U.S. foreign policy and trains. At the Lobito port on the Angolan coast, Amtrak Joe surveyed ne… [+15234 chars]"
     },
     {
          "title": "In India, Sri Lanka’s Dissanayake Reasserts Partnership",
          "description": "Like others in the region, Colombo’s new leader hopes to better balance ties with New Delhi and Beijing.",
          "url": "https://foreignpolicy.com/2024/12/18/india-sri-lanka-dissanayake-visit-modi-partnership-china/",
          "content": "Welcome to Foreign Policys South Asia Brief.\r\nThe highlights this week: Sri Lankan President Anura Kumara Dissanayake visits India in his first overseas trip as leader, a top Taliban leader is assass… [+9891 chars]"
     },
     {
          "title": "Vivek Kaul: The Union budget should focus on reviving private consumption",
          "description": "That is a key aim, since private investments haven’t picked up, but the government may have too little fiscal space for major tax cuts that could put money in the hands of consumers.",
          "url": "https://www.livemint.com/opinion/columns/vivek-kaul-the-union-budget-should-focus-on-reviving-private-consumption-demand-growth-economy-11735539826793.html",
          "content": "The Reserve Bank of India (RBI) recently released figures for net household financial savings (flow) during 2023-24. These savings stood at 5.3% of gross domestic product (GDP), up slightly from 5% i… [+4963 chars]"
     },
     {
          "title": "Saudi Arabia Deploys Robot Workers After More Than 21,000 Laborers Die",
          "description": "Saudi Arabia's biggest construction site is bringing in robotic aids amid allegations of worker mistreatment.",
          "url": "https://www.newsweek.com/saudi-arabia-deploys-robot-workers-after-more-21000-laborers-die-2004999",
          "content": "What's New\r\nThe biggest construction site in the world, located in Saudi Arabia, is deploying robotic construction aids to cut down on working hours, after the nation faces international scrutiny ove… [+3499 chars]"
     },
     {
          "title": "Skeptical Science New Research for Week #52 2024",
          "description": "Open access notables\nTrends in Oceanic Precipitation Characteristics Inferred From Shipboard Present-Weather Reports, 1950–2019, Tran & Petty, Journal of Geophysical Research: Atmospheres:\n\nAlthough ship reports are susceptible to subjective interpretation, t…",
          "url": "https://skepticalscience.com/new_research_2024_52.html",
          "content": "Posted on 26 December 2024 by Doug Bostrom, Marc Kodack\r\n Open access notables\r\nTrends in Oceanic Precipitation Characteristics Inferred From Shipboard Present-Weather Reports, 1950–2019, Tran &amp; … [+52511 chars]"
     },
     {
          "title": "A Return of Anti-Capitalist Vigilantism is Proving Surprisingly Popular",
          "description": "Suppose a company is operating on a business model that demonstrably depends on letting people die through intentional neglect. Is it murder for someone who becomes aware of that crime to take violent action to try to prevent more deaths? Take, for example, a…",
          "url": "https://www.counterpunch.org/2024/12/13/a-return-of-anti-capitalist-vigilantism-is-proving-surprisingly-popular/",
          "content": "Youtube screenshot.\r\nSuppose a company is operating on a business model that demonstrably depends on letting people die through intentional neglect. Is it murder for someone who becomes aware of that… [+17641 chars]"
     },
     {
          "title": "First Supertanker to Be Scrapped in 2 Years Is a Dark Ship",
          "description": "The 24 year old very large crude carrier was sold to an Indian scrapyard last week, according to a BRS Shipbrokers report and scrap dealer Wirana Shipping Corporation.",
          "url": "https://www.rigzone.com/news/wire/first_supertanker_to_be_scrapped_in_2_years_is_a_dark_ship-28-dec-2024-179154-article/",
          "content": "The Amor, a Cameroon-flagged vessel known to have transported Iranian oil, has become the first supertanker to be registered for demolition in more than two years, a sign that increased scrutiny on s… [+4231 chars]"
     },
     {
          "title": "First Supertanker to Be Scrapped in Two Years Is a Dark Ship",
          "description": "The Amor, a Cameroon-flagged vessel known to have transported Iranian oil, has become the first supertanker to be registered for demolition in more than two years, a sign that increased scrutiny on ships hauling sanctioned crude is raising pressure on operato…",
          "url": "https://gcaptain.com/first-supertanker-to-be-scrapped-in-two-years-is-a-dark-ship/",
          "content": "By Weilun Soon \r\nDec 27, 2024 (Bloomberg) –The Amor, a Cameroon-flagged vessel known to have transported Iranian oil, has become the first supertanker to be registered for demolition in more than two… [+4373 chars]"
     },
     {
          "title": "Indian Oil Probes Allegations of Albemarle Bribes to State Firm’s Officials",
          "description": "Indian Oil Corporation (IOC), a state-owned oil giant, has launched an internal investigation over alleged bribes paid by Albemarle to IOC officials to secure contracts more than a decade ago, Indian media report. Responding to news articles from last week, I…",
          "url": "https://oilprice.com/Latest-Energy-News/World-News/Indian-Oil-Probes-Allegations-of-Albemarle-Bribes-to-State-Firms-Officials.html",
          "content": "Oil prices are under pressure…\r\nChina's rapid ascension in the…\r\nBy Charles Kennedy - Dec 23, 2024, 10:30 AM CSTIndian Oil Corporation (IOC), a state-owned oil giant, has launched an internal investi… [+2071 chars]"
     },
     {
          "title": "Transforming agriculture",
          "description": "Holistic collective farming, a boon for small farmers",
          "url": "https://www.thehindubusinessline.com/opinion/transforming-agriculture/article68974098.ece",
          "content": "The agricultural landscape of India is a tale of stark contrasts. On one hand, large landowners thrive with access to resources and capital; on the other, small and marginal farmers struggle to susta… [+3570 chars]"
     },
     {
          "title": "Market Capitalisation of CPSEs doubled, net profit up losses down",
          "description": "Table Mailed While the net profit of all profit making CPSEs rose by over 38 per cent, losses of loss-making CPSEs came down by over 27 per cent",
          "url": "https://www.thehindubusinessline.com/todays-paper/tp-economy/market-capitalization-of-listed-cpses-doubled-in-fy-2024-25-with-net-profit-rising-and-losses-decreasing-significantly/article69004555.ece",
          "content": "Market capitalisation of listed Central Public Sector Enterprises (CPSEs) more than doubled in Fiscal Year 2024-25 as compared to Fiscal Year 2023-24, the latest edition of Public Enterprises Survey … [+3378 chars]"
     }
]